In [49]:
import pandas as pd
import mysql.connector

In [50]:
df_ataques = pd.read_csv("../data/04-tiburon_4.csv", index_col = 0)

In [51]:
df_climas = pd.read_csv("../data/00-datos_clima.csv", index_col= 0)

# Pair Programming ETL Carga I

Es el momento de meter todos nuestros datos en SQL !!! En este ejercicio nos crearemos dos tablas en una BBDD creada por nosotras. Una de las tablas contendr谩 la informaci贸n que obtuvimos de los ejercicios de pair programming de Limpieza, es decir, el data set de ataques de tiburones limpito. La segunda tabla tendr谩 la informaci贸n obtenida en el ejercicio de pair de ETL 1.

 Nota Todo lo tendremos que hacer desde jupyter notebook

1. Cread la BBDD con el nombre de tiburones.

2. Cread las tablas de la BBDD:
    - Tabla ataques
    - Tabla clima

3. BONUS Insertar los datos en las tablas.
 Nota Esta parte del pair es optativa y no ser谩 considerada para la evaluaci贸n

 En caso de que no teng谩is los datos unidos de la sesi贸n anterior, ten茅is un csv datos_union_clima_ataques con todos los datos que necesitareis para este ejercicio

Creamos una base de datos que se llame Tiburones

In [52]:
# Creamos la funci贸n para crear la base de datos
def crear_bbdd(nombre_bbdd):

    mydb = mysql.connector.connect(
      host="localhost",
      user="root",
      password='AlumnaAdalab' 
    )
    print("Conexi贸n realizada con 茅xito")
    
    mycursor = mydb.cursor()

    try:
        mycursor.execute(f"CREATE DATABASE IF NOT EXISTS {nombre_bbdd};")
        print(mycursor)
    except mysql.connector.Error as err:
        print(err)
        print("Error Code:", err.errno)
        print("SQLSTATE", err.sqlstate)
        print("Message", err.msg)

In [53]:
mydb = crear_bbdd("tiburones")

Conexi贸n realizada con 茅xito
CMySQLCursor: CREATE DATABASE IF NOT EXISTS tiburones;

In [54]:
# Creamos la funci贸n para crear las tablas
def crear_insertar_tabla(nombre_bbdd, contrase帽a, query):
    
    # nos conectamsos con el servidor usando el conector de sql
    cnx = mysql.connector.connect(user='root', password=f"{contrase帽a}",
                                     host='127.0.0.1', database=f"{nombre_bbdd}")
    # iniciamos el cursor
    mycursor = cnx.cursor()
    
    # intentamos hacer la query
    try: 
        mycursor.execute(query)
        cnx.commit() 
    # en caso de que podamos ejecutar la query devuelvenos un error para saber en que nos estamos equivocando
    except mysql.connector.Error as err:
        print(err)
        print("Error Code:", err.errno)
        print("SQLSTATE", err.sqlstate)
        print("Message", err.msg)

In [55]:
df_ataques.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1669 entries, 0 to 1671
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   year      1669 non-null   int64
 1   type      1669 non-null   object
 2   country   1669 non-null   object
 3   activity  1638 non-null   object
 4   age       1669 non-null   float64
 5   species_  1669 non-null   object
 6   mes       1669 non-null   object
 7   deceso    1669 non-null   object
 8   genero    1655 non-null   object
dtypes: float64(1), int64(1), object(7)
memory usage: 130.4+ KB

In [56]:
df_ataques.isnull().sum()

year         0
type         0
country      0
activity    31
age          0
species_     0
mes          0
deceso       0
genero      14
dtype: int64

In [57]:
# Observamos que tenemos nulos, los sustituimos por desconocido
df_ataques['genero'].fillna('Unknow', inplace= True)
df_ataques['activity'].fillna('Unknow', inplace= True)

In [58]:
df_ataques.isnull().sum()

year        0
type        0
country     0
activity    0
age         0
species_    0
mes         0
deceso      0
genero      0
dtype: int64

In [59]:
df_ataques.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1669 entries, 0 to 1671
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   year      1669 non-null   int64
 1   type      1669 non-null   object
 2   country   1669 non-null   object
 3   activity  1669 non-null   object
 4   age       1669 non-null   float64
 5   species_  1669 non-null   object
 6   mes       1669 non-null   object
 7   deceso    1669 non-null   object
 8   genero    1669 non-null   object
dtypes: float64(1), int64(1), object(7)
memory usage: 130.4+ KB

In [60]:
tabla_ataques = '''
CREATE TABLE IF NOT EXISTS `tiburones`.`ataques` (
  `id_ataques` INT NOT NULL AUTO_INCREMENT,
  `year` INT NOT NULL,
  `type`VARCHAR (225) NOT NULL,
  `country` VARCHAR (225) NOT NULL,
  `activity` VARCHAR (225) NOT NULL,
  `age` FLOAT NOT NULL,
  `species_` VARCHAR (225) NOT NULL,
  `mes` VARCHAR (45) NOT NULL,
  `deceso` VARCHAR (45) NOT NULL,
  `genero` VARCHAR (45) NOT NULL,
  PRIMARY KEY (`id_ataques`))
ENGINE = InnoDB;
'''

In [61]:
df_climas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 320 entries, 0 to 319
Data columns (total 19 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   timepoint          320 non-null    int64
 1   cloudcover         320 non-null    int64
 2   highcloud          320 non-null    int64
 3   midcloud           320 non-null    int64
 4   lowcloud           320 non-null    int64
 5   rh_profile         320 non-null    object
 6   wind_profile       320 non-null    object
 7   temp2m             320 non-null    int64
 8   lifted_index       320 non-null    int64
 9   rh2m               320 non-null    int64
 10  msl_pressure       320 non-null    int64
 11  prec_type          320 non-null    object
 12  prec_amount        320 non-null    int64
 13  snow_depth         320 non-null    int64
 14  wind10m.direction  320 non-null    int64
 15  wind10m.speed      320 non-null    int64
 16  country            320 non-null    object
 17  latitud            320 non-null    float64
 18  longitud           320 non-null    float64
dtypes: float64(2), int64(13), object(4)
memory usage: 50.0+ KB

In [62]:
tabla_clima = '''
CREATE TABLE IF NOT EXISTS `tiburones`.`clima` (
  `id_clima` INT NOT NULL AUTO_INCREMENT,
  `timepoint` INT NOT NULL,
  `cloudcover` INT NOT NULL,
  `highcloud` INT NOT NULL,
  `midcloud` INT NOT NULL,
  `lowcloud` INT NOT NULL,
  `rh_profile` VARCHAR (45) NOT NULL,
  `wind_profile` VARCHAR (45) NOT NULL,
  `temp2m` INT NOT NULL,
  `lifted_index` INT NOT NULL,
  `rh2m` INT NOT NULL,
  `msl_pressure` INT NOT NULL,
  `prec_type` VARCHAR (45) NOT NULL,
  `prec_amount` INT NOT NULL,
  `snow_depth` INT NOT NULL,
  `wind10m.direction` INT NOT NULL,
  `wind10m.speed` INT NOT NULL,
  `country` VARCHAR (45) NOT NULL,
  `latitud` DECIMAL NOT NULL,
  `longitud` DECIMAL NOT NULL,
  PRIMARY KEY (`id_clima`))
ENGINE = InnoDB;
'''

In [63]:
crear_insertar_tabla("tiburones", "AlumnaAdalab", tabla_ataques)

In [64]:
crear_insertar_tabla("tiburones", "AlumnaAdalab", tabla_clima)

In [65]:
df_ataques.columns

Index(['year', 'type', 'country', 'activity', 'age', 'species_', 'mes',
       'deceso', 'genero'],
      dtype='object')

In [68]:
df_ataques.iloc[1,:]

year              2018
type        Unprovoked
country         brazil
activity      Swimming
age               18.0
species_         Tiger
mes                Jun
deceso               Y
genero               M
Name: 1, dtype: object

In [66]:
for indice, fila in df_ataques.iterrows(): # iteramos por el dataframe.
    
    # definimos nuestra query, igual que si lo hicieramos en workbench. 锔 Como estamos definiendo nuestra query en varias l铆neas usamos las triples comillas
    # lo valores que introduciremos ser谩n los del dataframe que estamos iterando, por lo que usaremos los formats de los strings. 
    
    query_ataques = f"""
            INSERT INTO ataques (year, type, country, activity, age, species_, mes, deceso, genero)
            VALUES ( "{fila['year']}", "{fila['type']}", "{fila['country']}", "{fila['activity']}", "{fila['age']}", "{fila['species_']}", "{fila['mes']}", "{fila['deceso']}", "{fila['genero']}");
            """
    # una vez definida la query llamamos a la funci贸n que nos inserta los datos. 
    crear_insertar_tabla("tiburones", "AlumnaAdalab", query_ataques)

1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'Jaws"", "19.0", "White", "Nov", "N", "M")' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'Jaws"", "19.0", "White", "Nov", "N", "M")' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'the creature cast the man out of his throat."", "27.87", "Unspecified", "Unknow"' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'the creature cast the man out of his throat."", "27.87", "Unspecified", "Unknow"' at line 2